In [2]:
data = {'Name':['John','Rob','Sansa'],
       'Age':[34,23,12],
       'Salary':[3000,4000,2500]}

In [3]:
from pandas import DataFrame
frame = DataFrame(data)

In [4]:
frame

    Name  Age  Salary
0   John   34    3000
1    Rob   23    4000
2  Sansa   12    2500

In [9]:
new_frame = DataFrame(data,columns=['Name','Age','Salary'])

In [10]:
new_frame

    Name  Age  Salary
0   John   34    3000
1    Rob   23    4000
2  Sansa   12    2500

In [11]:
new_frame['Name']

0     John
1      Rob
2    Sansa
Name: Name, dtype: object

In [17]:
new_frame.iloc[2]

Name      Sansa
Age          12
Salary     2500
Name: 2, dtype: object

In [19]:
new_frame['Profile']='Engineer'
new_frame

    Name  Age  Salary   Profile
0   John   34    3000  Engineer
1    Rob   23    4000  Engineer
2  Sansa   12    2500  Engineer

In [20]:
new_frame['Education'] = 'MS'
new_frame

    Name  Age  Salary   Profile Education
0   John   34    3000  Engineer        MS
1    Rob   23    4000  Engineer        MS
2  Sansa   12    2500  Engineer        MS

In [22]:
new_frame = new_frame.T
new_frame

                  0         1         2
Name           John       Rob     Sansa
Age              34        23        12
Salary         3000      4000      2500
Profile    Engineer  Engineer  Engineer
Education        MS        MS        MS

In [1]:
print('Hola celda')

Hola celda

In [11]:
from pandas import Series
obj = Series([10,20,30,40,50],['a','b','c','d','e'])
obj

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [12]:
obj = obj.reindex(['e','d','c','b','a'])
obj

e    50
d    40
c    30
b    20
a    10
dtype: int64

In [5]:
frame = frame.reindex([0,2,1])
frame

    Name  Age  Salary
0   John   34    3000
2  Sansa   12    2500
1    Rob   23    4000

In [6]:
fields = ['Name','Age','Salary']
frame = frame.reindex(columns=fields)
frame

    Name  Age  Salary
0   John   34    3000
2  Sansa   12    2500
1    Rob   23    4000

In [7]:
frame2 = frame.drop(1)
frame2

    Name  Age  Salary
0   John   34    3000
2  Sansa   12    2500

In [9]:
frame3 = frame.drop('Age',axis=1)
frame3

    Name  Salary
0   John    3000
2  Sansa    2500
1    Rob    4000